# Pandas

In [12]:
#pandas ==> open source library ==> data manipulation
#data structure ==> (1). series (2). Dataframe
#(1). series==> 1d dataset we can get only values
#(2).data frame==> 2d we can get label name with values

In [1]:
import pandas as pd

In [20]:
a={
    "emp_id":[1,2,3,4,5],
    "name":["nikhil","ankush","raj","gaurav","tej"],
    "department":["IT","HR","OPERATIONS","IT","IT"],
    "working_hours":[8,7,9,8,7]
}
b=pd.DataFrame(a)
b

   emp_id    name  department  working_hours
0       1  nikhil          IT              8
1       2  ankush          HR              7
2       3     raj  OPERATIONS              9
3       4  gaurav          IT              8
4       5     tej          IT              7

# how to save this dataframe into excel

In [22]:
b.to_csv("C:\\Users\\user\\pandas\\emp_info.csv",index=False)

# how to upload csv file into jupyter using pandas

In [13]:
df=pd.read_csv("C:\\Users\\user\\pandas\\emp_info.csv")

In [14]:
df

   emp_id    name  department  working_hours
0       1  nikhil          IT              8
1       2  ankush          HR              7
2       3     raj  OPERATIONS              9
3       4  gaurav          IT              8
4       5     tej          IT              7

# how to read top 5 data using pandas

In [15]:
df.head(2)#returns top data (default=5)

   emp_id    name department  working_hours
0       1  nikhil         IT              8
1       2  ankush         HR              7

# how to read bottom 5 data using pandas

In [16]:
df.tail(2)

   emp_id    name department  working_hours
3       4  gaurav         IT              8
4       5     tej         IT              7

# how to get random indexed dataset

In [17]:
df.sample(3)

   emp_id    name  department  working_hours
2       3     raj  OPERATIONS              9
0       1  nikhil          IT              8
4       5     tej          IT              7

In [18]:
df.columns

Index(['emp_id', 'name', 'department', 'working_hours'], dtype='object')

In [19]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['emp_id', 'name', 'department', 'working_hours'], dtype='object')]

In [23]:
df.info()# accomplete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   emp_id         5 non-null      int64
 1   name           5 non-null      object
 2   department     5 non-null      object
 3   working_hours  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [35]:
df.describe()# we can check statically view of data

         emp_id  working_hours
count  5.000000        5.00000
mean   3.000000        7.80000
std    1.581139        0.83666
min    1.000000        7.00000
25%    2.000000        7.00000
50%    3.000000        8.00000
75%    4.000000        8.00000
max    5.000000        9.00000

In [36]:
df["department"].value_counts()

department
IT            3
HR            1
OPERATIONS    1
Name: count, dtype: int64

In [37]:
#dataframe ==> mutable

In [38]:
df["name"][4]="rishi"

C:\Users\user\AppData\Local\Temp\ipykernel_6724\1726394890.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["name"][4]="rishi"

In [39]:
df

   emp_id    name  department  working_hours
0       1  nikhil          IT              8
1       2  ankush          HR              7
2       3     raj  OPERATIONS              9
3       4  gaurav          IT              8
4       5   rishi          IT              7

In [40]:
#loc and iloc ==> data extraction
#df.loc[row_number,column_name]==>starting + last value include
#df.iloc[row_number,column_range]==>staring value include + last value exclude

In [41]:
df.loc[2:3,["name"]]

     name
2     raj
3  gaurav

In [42]:
df.iloc[2:3,[1,2]]

  name  department
2  raj  OPERATIONS

In [43]:
df["department"][2]="interns"
df["working_hours"][2]=8

C:\Users\user\AppData\Local\Temp\ipykernel_6724\3857443378.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["department"][2]="interns"
C:\Users\user\AppData\Local\Temp\ipykernel_6724\3857443378.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["working_hours"][2]=8

In [44]:
df

   emp_id    name department  working_hours
0       1  nikhil         IT              8
1       2  ankush         HR              7
2       3     raj    interns              8
3       4  gaurav         IT              8
4       5   rishi         IT              7

# Assignment

In [2]:
c=pd.read_csv("C:\\Users\\user\\Downloads\\covid_toy.csv")

In [3]:
c

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [5]:
c.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [4]:
c.tail()

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

In [6]:
c.sample(5)

    age  gender  fever cough     city has_covid
49   44    Male  104.0  Mild   Mumbai        No
80   14  Female   99.0  Mild   Mumbai       Yes
93   27    Male  100.0  Mild  Kolkata       Yes
23   80  Female   98.0  Mild    Delhi       Yes
25   23    Male    NaN  Mild   Mumbai        No

In [7]:
c.columns

Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')

In [8]:
c.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')]

In [10]:
c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [25]:
c.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [27]:
c["gender"].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [29]:
c["city"].value_counts()

city
Kolkata      32
Bangalore    30
Delhi        22
Mumbai       16
Name: count, dtype: int64

In [30]:
c.loc[5:10,["age","city","cough"]]

    age       city   cough
5    84  Bangalore    Mild
6    14  Bangalore  Strong
7    20     Mumbai  Strong
8    19  Bangalore  Strong
9    64      Delhi    Mild
10   75      Delhi    Mild

In [33]:
c.iloc[10:20,[0,4,2]]

    age       city  fever
10   75      Delhi    NaN
11   65     Mumbai   98.0
12   25    Kolkata   99.0
13   64  Bangalore  102.0
14   51  Bangalore  104.0
15   70    Kolkata  103.0
16   69    Kolkata  103.0
17   40      Delhi   98.0
18   64  Bangalore   98.0
19   42  Bangalore    NaN